{
  "scraped_at": "2025-08-27T19:38:24.250491",
  "total_speakers": 44,
  "speakers_with_detailed_bios": 31,
  "processed_speakers": 37,
  "source_url": "https://sofweek.org/agenda/",
  "cvent_url": "https://event-guestside-app-pr50.cvent-production.cvent.cloud/embedded-agenda/461ba942-5adb-45cf-a9e5-e8e40dd9305c",
  "description": "SOF Week 2025 Complete Speaker List with FIXED Bio Extraction",
  "speakers": [
    {
      "name": "Mr. Jeff Pottinger",
      "title": "Co-Founder",
      "company": "ReLAUNCH Advisors",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/2f32c669400e4525bf03f68358ba232d.png?f=webp",
      "detailed_bio": ", resume, interviews, and networking. Employee Engagement Workshops – Inspire employee engagement and align individual WHY and Strengths with organizational goals. Career Transition Seminars – Work closely with veterans and professionals to provide tailored strategies for navigating your next career move. WHY We Should Work Together Are you ready to uncover your WHY, harness your Strengths, and build a career narrative or organizational culture that reflects the real you? Let’s connect and explore how I can help you or your team achieve your goals. Reach out to me today at jeff.pottinger@relaunchadvisors.com!",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "The Honor Foundation Transition Seminar | Pre-registration is required",
      "speaking_time": "9:00 AM-4:00 PM",
      "location": "Tampa Convention Center: Room 118 - 119",
      "session_description": "This one-day seminar will be executed by The Honor Foundation. Ideal for military personnel that are 24 to 18 months out from retirement or separation from active-duty service.Open to both U.S. and Partner Nation SOF as well as spouses. Requires a separate pre-registration and is not open to walk-ins. The seminar will provide attendees with:A clear understanding of what motivates you and why. Why is not about making money–that’s a result. Why is a purpose, cause, or belief. It’s the very reason ..."
    },
    {
      "name": "Mr. Matt Stevens",
      "title": "Chief Executive Officer",
      "company": "The Honor Foundation",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/65217d1d62b2439996a3212409953eb7.png?f=webp",
      "detailed_bio": "Mr. Matt StevensChief Executive Officer The Honor Foundation Matt Stevens is the Chief Executive Officer of The Honor Foundation (THF) and a member of its board of directors. Previously, Matt served as a Navy SEAL for 26 years, where he led high-performing teams conducting our nation’s most sensitive operations, cultivated interagency relationships, and executed operations in the most dynamic environments. Immediately following his Navy career, Matt served on the leadership team of an emerging technology firm. Matt graduated from the U.S. Naval Academy with a B.S. in Ocean Engineering and completed Basic Underwater Demolition/SEAL (BUD/S) training with class 179. He commanded at every level in the Naval Special Warfare Community, including a Squadron at Naval Special Warfare Development Group, SEAL Team TWO, Naval Special Warfare Unit THREE, and Naval Special Warfare Group FOUR. He also served in staff roles at the Joint Special Operations Command in Fort Bragg, NC; as the Operations Officer at Naval Special Warfare Group TWO in Virginia Beach, VA; and in the Office of the Assistant Secretary of Defense for Special Operations and Low-Intensity Conflict (ASD SO/LIC) in the Pentagon. Matt is a graduate of THF’s program and remains deeply passionate about serving others and advocating for veterans’ issues. In his free time, he enjoys exploring the great outdoors.",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "The Honor Foundation Transition Seminar | Pre-registration is required",
      "speaking_time": "9:00 AM-4:00 PM",
      "location": "Tampa Convention Center: Room 118 - 119",
      "session_description": "This one-day seminar will be executed by The Honor Foundation. Ideal for military personnel that are 24 to 18 months out from retirement or separation from active-duty service.Open to both U.S. and Partner Nation SOF as well as spouses. Requires a separate pre-registration and is not open to walk-ins. The seminar will provide attendees with:A clear understanding of what motivates you and why. Why is not about making money–that’s a result. Why is a purpose, cause, or belief. It’s the very reason ..."
    },
    {
      "name": "Mr. William \"Bill\" Innes",
      "title": "Deputy Director, Acquisition, SOF AT&L",
      "company": "U.S. Special Operations Command",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/356d47f4982a4b5caae2ae72306b1ff8.png?f=webp",
      "detailed_bio": "Mr. William \"Bill\" InnesDeputy Director, Acquisition, SOF AT&L U.S. Special Operations Command Mr. Innes entered civil service upon graduation from St. Louis University in 1993 and subsequent positions in industry. His initial government assignment in 1997 was to the San Antonio Air Logistics Center, Kelly AFB, TX, providing engineering support to the propulsion directorate and later the C-17 program on-site at Charleston AFB, SC. Following a short period at Warner-Robins ALC, Mr. Innes was assigned to the Aeronautical Systems Center, Wright-Patterson Air Force Base, Ohio supporting the F-22 program as Chief Sustainment Engineer. This led to his selection as the CV-22 Chief Engineer at Patuxent River NAS. Mr. Innes then broadened his DoD organizational and technical knowledge base as Senior Defense Analyst in the Office of the Secretary of Defense, AT&L (Industrial Policy). In 2009, Mr. Innes volunteered for a 12-month assignment to Kabul, Afghanistan supporting Operation Enduring Freedom where he supported the US Army and US Agency for International Development as a Program Manager for large infrastructure projects throughout the country. Upon completion of the assignment, Mr. Innes returned to the Air Force and the CV-22 program, taking on the role of Deputy Program Manager. In 2012 he was assigned to USTRANSCOM as Division Chief for a portfolio of Information Technology programs. He was promoted to SES and assigned as Deputy Director, Acquisition for USSOCOM in May 2019.",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "SOF Week Welcome Remarks | Introduction to Special Operations Forces Acquisition, Technology, and Logistics (SOF AT&L)",
      "speaking_time": "9:55 AM-11:00 AM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "Join us for the formal kick-off for SOF Week 2025 followed by Mr. William \"Bill\" Innes presenting an overview of the command and acquisition center and its current programs. This event is structured to provide insight into initiatives and processes for those who have not recently done business with USSOCOM as well as provide guidelines for making the most of your time at SOF Week."
    },
    {
      "name": "Ms. Meaghan Keeler",
      "title": "Chief Operating Officer",
      "company": "Global SOF Foundation",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/0f7ecf3eda5441efaf7c90d180f01b11.jpg?f=webp",
      "detailed_bio": "Ms. Meaghan KeelerChief Operating Officer Global SOF Foundation Ms. Meaghan Keeler is the founding Chief Operating Officer of the Global SOF Foundation and an International Security Fellow at New America. She is responsible for the Foundation’s operations, financial stewardship, and program delivery. Prior to her position with the Foundation, Ms. Keeler worked for CACI supporting Operational Planning Teams at U.S. Special Operations Command. In this capacity, Ms. Keeler managed a team of analysts, subject matter experts, writers, research associates, and strategic communicators. Previously, she worked in the Commander’s Action Group and Operations Directorate at U.S. Central Command, supporting the 4-star commander. Ms. Keeler was also the Interim Executive Director and Events Coordinator for Women In International Security, a non-profit professional membership organization for women who work in international affairs. She holds master’s and bachelor’s degrees from Georgetown University’s Walsh School of Foreign Service. She lives in St. Petersburg, FL.",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "SOF Week Welcome Remarks | Introduction to Special Operations Forces Acquisition, Technology, and Logistics (SOF AT&L)",
      "speaking_time": "9:55 AM-11:00 AM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "Join us for the formal kick-off for SOF Week 2025 followed by Mr. William \"Bill\" Innes presenting an overview of the command and acquisition center and its current programs. This event is structured to provide insight into initiatives and processes for those who have not recently done business with USSOCOM as well as provide guidelines for making the most of your time at SOF Week."
    },
    {
      "name": "Ms. Leslie Babich",
      "title": "Director",
      "company": "SOFWERX",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/9ce336f32198437d8b88eccdaac84c7a.jpg?f=webp",
      "detailed_bio": "Ms. Leslie BabichDirector SOFWERX Leslie Babich joined the DEFENSEWERX team to lead SOFWERX in Tampa, FL in October 2020. As the Director of SOFWERX, Leslie provides operational and personnel oversight while developing and implementing business plans that optimize results for its government partner, the United States Special Operations Command (USSOCOM). Leslie brings 20+ years of special operations experience where she served as an MC-130E/H Pilot in Air Force Special Operations Command and held various leadership positions to include squadron command, Director of the Commander’s Action Group at Headquarters, Air Force Special Operations Command, and Commander, Joint Special Operations Air Component - Central. She also served as the Fixed-Wing Assessment Director and Chief of Program Analysis and Evaluation at the United States Special Operations Command in the Force Structure, Requirements, Resources and Strategic Assessment Directorate. During her service, she deployed multiple times in support of Operations Enduring Freedom, Enduring Freedom-Philippines, Iraqi Freedom, and Inherent Resolve. Prior to joining SOFWERX, Leslie was employed as a Business Unit Manager with Jabil Defense and Aerospace in Saint Petersburg, FL. Leslie received her Bachelor of Science in Management from the Air Force Academy, her Master of Arts in Counseling and Leadership from the University of Colorado, and her Master of Science in International Strategic Studies from the Air War College at Maxwe...",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Introduction to SOFWERX",
      "speaking_time": "11:00 AM-12:00 PM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "SOFWERX and SOF AT&L Acquisition Resources will provide an overview of how industry, academia, laboratories, and others can leverage the SOFWERX platform to do business with USSOCOM to help address the challenging problems facing our warfighters."
    },
    {
      "name": "Mr. Glen Cullen",
      "title": "Program Manager, SOF AT&L",
      "company": "U.S. Special Operations Command",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/cc927d2c127b48c4884ed00295e550a4.jpg?f=webp",
      "detailed_bio": "",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Introduction to SOFWERX",
      "speaking_time": "11:00 AM-12:00 PM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "SOFWERX and SOF AT&L Acquisition Resources will provide an overview of how industry, academia, laboratories, and others can leverage the SOFWERX platform to do business with USSOCOM to help address the challenging problems facing our warfighters."
    },
    {
      "name": "Mr. Travis Owens",
      "title": "Chief, Visual Multimedia Support Division",
      "company": "U.S. Special Operations Command",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/e634b02ff422462ba4fe25ff612ffd91.png?f=webp",
      "detailed_bio": "Mr. Travis OwensChief, Visual Multimedia Support Division U.S. Special Operations Command Travis Owens serves as the Chief, Visual Multimedia Support Division, United States Special Operations Command, MacDill AFB, FL. His office provides internal visual information product support to the United States Special Operations Command Headquarters (USSOCOM HQ) and the SOF enterprise. He enlisted in the United States Army in 2002 and was assigned to the 4th Psychological Operations Group (4th POG), Ft. Bragg, NC. As a Multimedia Illustrator (25M) and paratrooper in 3rd Battalion Bravo Company, he created radio, video, and print products for use in tactical Psychological Operations (PSYOP). He then deployed to Afghanistan in support of Operation Enduring Freedom, attached to 3rd Special Forces Group, conducting PSYOP product development and dissemination. In 2006, after his time in the military, Mr. Owens began his career as a government civilian at the United States Special Operations Command (USSOCOM) Headquarters, MacDill AFB, FL. He is a plank holder with the Joint Psychological Operations Support Element (JPSE), Product Development Branch (PDB), where he served as an Audio-Visual Specialist creating strategic PSYOP video products. This organization was later renamed the Joint Military Information Support Command (JMISC) and subsequently relocated to Ft. Bragg, NC. Mr. Owens was then transferred to the Visual Information Center (VIC), later renamed the Visual Multimedia Support D...",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "USSOCOM Visual Information Seminar",
      "speaking_time": "12:00 PM-4:00 PM",
      "location": "Tampa Convention Center: Room 120 - 121",
      "session_description": "Join us for an engaging and informative breakout session designed to bring together Headquarters and related special operations creative personnel. This session will cover a range of topics including the USSOCOM branding guidelines, providing insights on how to align creative work with the organization's standards. Attendees will also have the opportunity to showcase their previous year's video, print, and graphic design projects, celebrating the diverse creative efforts within the community. In..."
    },
    {
      "name": "Ms. Lisa R. Sanders",
      "title": "Director, Science and Technology Directorate",
      "company": "U.S. Special Operations Command",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/95e91577e5c14dda803ca464cf7de0c3.png?f=webp",
      "detailed_bio": "Ms. Lisa R. SandersDirector, Science and Technology Directorate U.S. Special Operations Command Ms. Lisa R. Sanders is the Director of Science and Technology for Special Operations Forces, Acquisition, Technology & Logistics (SOF AT&L), U.S. Special Operations Command (USSOCOM), MacDill Air Force Base, Florida. She is responsible for all research and development funded activities and has over 30 years of civilian federal service. Ms. Sanders began her federal career as an Electronics Engineer at the Naval Avionics Center in Indianapolis, Indiana, where she served in quality engineering, production engineering, and program management roles. In 1996, she transferred to the Naval Air Warfare Center and Naval Air Systems Command (NAVAIR) at Patuxent River, Maryland, serving as an Electronics Engineer and Program Manager for the E-2C Hawkeye aircraft. In 2003, she assumed responsibility for the production and modification of the CV-22 Osprey. During her time at NAVAIR, she managed one of the first Multi-Year Procurements and executed the modification and delivery of CV-22 production and developmental test aircraft. Ms. Sanders transferred to USSOCOM in 2005, where she continued overseeing CV-22 production and served as the Systems Acquisition Manager for the C-130 program in the Program Executive Office Fixed Wing, managing all C-130 projects across the SOF inventory. In 2010, she was promoted to Deputy Director for the Science and Technology Directorate, and in 2011, she assumed ...",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "SBIR Overview and Q&A",
      "speaking_time": "1:00 PM-2:00 PM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "The USSOCOM SOF AT&L Science and Technology Director presents the SBIR Overview followed by DoD Component specific presentations from the U.S. Army, U.S. Air Force, U.S. Navy, and USSOCOM. In this session, you will receive an introduction to the SBIR/STTR program and understand their specific instruction on how best to support the varied Department of Defense (DoD).  The session will end with the panel fielding questions and answers from the audience."
    },
    {
      "name": "Ms. Melissa Johnson",
      "title": "Acquisition Executive",
      "company": "U.S. Special Operations Command",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/d9c941148daa44c4878d764487b28198.jpg?f=webp",
      "detailed_bio": "Ms. Melissa JohnsonAcquisition Executive U.S. Special Operations Command Melissa A. Johnson, a member of the Senior Executive Service, is the Acquisition Executive, U.S. Special Operations Command, MacDill Air Force Base, Florida. Ms. Johnson serves as the principal advisor to the Commander, United States Special Operations Command for Special Operations Research and Development, test, production, fielding, and sustainment of SOF-peculiar programs across aviation, space, cyber, maritime, ground, weapons, and communication systems. Ms. Johnson graduated from the University of Florida in 1995 and received her commission from the United States Air Force Officer Training School in March 1996. Throughout her 24 years on active duty, Ms. Johnson served in a variety of assignments and leadership roles ranging from Program Manager for a highly classified strategic combat system directed by the Deputy Secretary of Defense, to other significant leadership roles such the Director for non-standard Aircraft Systems and Materiel Leader for Strategic Combat Systems, Air Force Rapid Capabilities Office. For her final assignment, she served as the Program Executive Officer for Fixed Wing Programs, Headquarters U.S. Special Operations Command. Prior to her position as the Acquisition Executive, Ms. Johnson served as the Deputy Director and Acting Director for the Department of the Air Force’s Rapid Capabilities Office. She oversaw selected study, development, and fielding activities tasked dir...",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "USSOCOM Acquisition Executive Small Business Forum",
      "speaking_time": "2:15 PM-3:15 PM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "The USSOCOM Acquisition Executive, Director of Procurement, Chief of Programs in the Science & Technology Directorate, and Office of Small Business Programs Director will discuss USSOCOM’s small business programs and doing business with the Command. This session will include a brief overview of SOF AT&L followed by an open Q&A."
    },
    {
      "name": "Colonel Clarence E. Burton, Jr.",
      "title": "Director of Procurement",
      "company": "U.S. Special Operations Command",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/8816c2ac761c45d6b3f4461953ba7ba7.jpg?f=webp",
      "detailed_bio": "Colonel Clarence E. Burton, Jr.Director of Procurement U.S. Special Operations Command Colonel Burton is the Director of Procurement for the United States Special Operations Command. His role is to rapidly deploy contracting expertise resulting in superior technologies, equipment, and services for Special Operations Forces. Colonel Burton entered the Air Force in 2003 through the Reserve Officer Training Corps at The Citadel, Charleston, S.C. He is a joint qualified officer and has served as a two-time squadron commander, and a contracting officer for the Warner Robins Air Logistics Complex and Special Operations Command Europe. His career also includes a broadening assignment as a Program Element Monitor in the Office of the Assistant Secretary of the Air Force for Acquisition, Technology, and Logistics’ Global Power Programs Directorate. In this role, Colonel Burton directed acquisition planning, programming, budgeting, and execution for the $13 billion F-15C, F-15E, and F-15EX investment portfolios. In 2007, Colonel Burton deployed to Kabul, Afghanistan as a Contingency Contracting Officer in support of OPERATION ENDURING FREEDOM. Prior to his current assignment, Colonel Burton was a military student assigned to the Dwight D. Eisenhower School for National Security and Resource Strategy at the National Defense University in Washington D.C.",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "USSOCOM Acquisition Executive Small Business Forum",
      "speaking_time": "2:15 PM-3:15 PM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "The USSOCOM Acquisition Executive, Director of Procurement, Chief of Programs in the Science & Technology Directorate, and Office of Small Business Programs Director will discuss USSOCOM’s small business programs and doing business with the Command. This session will include a brief overview of SOF AT&L followed by an open Q&A."
    },
    {
      "name": "Mr. John Burnham",
      "title": "CAPTAIN, USN (Ret.); Former Deputy Assistant Secretary of Defense",
      "company": "Global SOF Advisory Board",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/21a14f58da654bcba7cc93f56054af1b.jpg?f=webp",
      "detailed_bio": "Mr. John BurnhamCAPTAIN, USN (Ret.); Former Deputy Assistant Secretary of Defense Global SOF Advisory Board John Burnham serves as Mission Command Integration lead for the Defense & Intel portfolio of Accenture Federal Services, serving clients across the DoD and Intelligence Communities. Before joining Accenture in 2017 he was a naval officer serving in Naval Special Warfare for 28 years and deploying around the world in tactical, operational and command levels. After retiring from active duty in 2014 he was appointed Deputy Assistant Secretary of Defense and served for three years in the Obama administration. His military assignments include deployments as a Surface Warfare Officer onboard USS MARVIN SHIELDS (FF-1066); tactical and senior operational leadership tours at SEAL Team TWO, Naval Special Warfare Development Group, and Joint Special Operations Command (JSOC); command of SEAL Team FOUR; numerous deployments in command of Joint Special Operations Task Forces in Afghanistan, Iraq, and other locations; and command of JSOC’s Joint Interagency Task Force. Mr. Burnham is a graduate of the University of Pennsylvania, holds an MBA from the College of William & Mary and is a Distinguished Graduate of the National War College. He and his family live in Arlington, Virginia.",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "General Session Opening Remarks | Welcome Remarks and Proclamation from the Mayor of Tampa | Welcome Remarks from Global SOF",
      "speaking_time": "8:25 AM-8:45 AM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "The SOF Week 2025 general session launches with a superb lineup of senior SOF leaders and national security practitioners.If the room has reached maximum capacity, you may view the session virtually inThe JW Marriott, Level 2, H.B. Plant Ballroom , \"SOF Team Room.\"Viewing schedule: 0830 - 1030"
    },
    {
      "name": "Mayor Jane Castor",
      "title": "Mayor",
      "company": "City of Tampa",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/ea27201602274671aa9f8bab56d22adc.jpg?f=webp",
      "detailed_bio": "",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "General Session Opening Remarks | Welcome Remarks and Proclamation from the Mayor of Tampa | Welcome Remarks from Global SOF",
      "speaking_time": "8:25 AM-8:45 AM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "The SOF Week 2025 general session launches with a superb lineup of senior SOF leaders and national security practitioners.If the room has reached maximum capacity, you may view the session virtually inThe JW Marriott, Level 2, H.B. Plant Ballroom , \"SOF Team Room.\"Viewing schedule: 0830 - 1030"
    },
    {
      "name": "The Honorable Pete Hegseth",
      "title": "Secretary of Defense",
      "company": "U.S. Department of Defense",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/d1bcccf33ccc4fbab7d5313476e6cb7f.jpeg?f=webp",
      "detailed_bio": "The Honorable Pete HegsethSecretary of Defense U.S. Department of Defense The Honorable Pete Hegseth is the 29th Secretary of Defense, sworn in on Jan. 25, 2025. Hegseth was commissioned as an infantry officer in the U.S. Army National Guard after graduating from Princeton University in 2003. He participated in a number of active-duty deployments during his time in service, including operations in Guantanamo Bay, Iraq and Afghanistan. Hegseth also served in multiple staff positions in the National Guard. Hegseth's military awards include two Bronze Star Medals, the Joint Commendation Medal, two Army Commendation Medals, the Combat Infantryman Badge (CIB) and the Expert Infantryman Badge (EIB). He has authored five books, including the New York Times best-seller The War on Warriors (2024).",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Keynote Address: U.S. Secretary of Defense",
      "speaking_time": "8:45 AM-9:15 AM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": ""
    },
    {
      "name": "General Bryan P. Fenton",
      "title": "Commander",
      "company": "U.S. Special Operations Command",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/b8fffbbb945e4efbaa5d9d0b45eeb34c.jpg?f=webp",
      "detailed_bio": "General Bryan P. FentonCommander U.S. Special Operations Command General Bryan P. Fenton is a career Special Forces (Green Beret) Officer. He currently serves as the 13th Commander of the U.S. Special Operations Command (USSOCOM), located at MacDill Air Force Base, FL. He oversees all Special Operations for the U.S. Department of Defense with 70,000 Army, Navy, Air Force, and Marine Special Operations personnel and an annual budget of $14 billion. Before assuming command of USSOCOM, General Fenton served as the Commander of Joint Special Operations Command (JSOC), headquartered at Fort Liberty, NC. Prior to that, he was the Senior Military Assistant for two U.S. Secretaries of Defense. General Fenton’s other general officer assignments include: Deputy Commander of U.S. Indo-Pacific Command; Commander of U.S. Special Operations – Pacific; and Deputy Commanding General of the U.S. Army’s 25th Infantry Division in Hawaii. He has commanded at all levels and his Joint and Special Operations assignments include: Director of Operations (J3) at the Joint Special Operations Command; Brigade, Battalion, and Squadron Commands; multiple overseas Task Force Commands; Detachment Commander and Operations Officer in 1st Battalion, 7th Special Forces Group (Airborne); as well as Infantry Rifle Platoon Leader and Executive Officer in Bravo Company, 4th Battalion, 502 Infantry Regiment (Berlin). General Fenton deployed multiple times, participating in Operation Joint Forge (Bosnia); Operation E...",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Keynote Address: U.S. Special Operations Command Team",
      "speaking_time": "9:15 AM-10:00 AM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "Keynote remarks from USSOCOM Commander, General Bryan Fenton and Senior Enlisted Leader, Command Sergeant Major Shane Shorter.If the room has reached maximum capacity, you may view the session virtually inThe JW Marriott, Level 2, H.B. Plant Ballroom , \"SOF Team Room.\"Viewing schedule: 0830 - 1030"
    },
    {
      "name": "Command Sergeant Major Shane Shorter",
      "title": "Senior Enlisted Leader",
      "company": "U.S. Special Operations Command",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/f497cc05abf64c6baa3a929d3aa850c6.png?f=webp",
      "detailed_bio": "Command Sergeant Major Shane ShorterSenior Enlisted Leader U.S. Special Operations Command Command Sergeant Major Shorter enlisted in the Army in 1988 and attended Infantry Basic Training and Advanced Individual Training at Fort Benning, GA. He was subsequently assigned to 3rd Infantry Division in Kitzingen, Germany. Command Sergeant Major Shorter volunteered for Special Forces training and graduated the Special Forces Qualification Course in 1992. He was then assigned to 3rd Battalion, 1st Special Forces Group (A) at Fort Lewis Washington. During the following 23 years, he has held the positions of Junior Medical NCO, Senior Medical NCO, Team Sergeant and HSC First Sergeant. His Sergeant Major assignments with 1st Special Forces Group include: OPSDET Sergeant Major, Company Sergeant Major for Charlie Company 3rd Battalion, Group Operations Sergeant Major, 1st Battalion Command Sergeant Major and Group Command Sergeant Major. Command Sergeant Major Shorter’s nominative positions include the Command Senior Enlisted Leader of Special Operations Command Pacific, United States Indo-Pacific Command, and Joint Special Operations University (JSOU). Command Sergeant Major Shorter’s military education includes every level of Non- Commissioned Officer Professional Development, to include the Summit Course. He is a graduate of the Special Forces Qualification Course, Special Forces Operations and Intelligence Course, Static Line Jumpmaster Course, Dive Medical Technician’s Course and th...",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Keynote Address: U.S. Special Operations Command Team",
      "speaking_time": "9:15 AM-10:00 AM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "Keynote remarks from USSOCOM Commander, General Bryan Fenton and Senior Enlisted Leader, Command Sergeant Major Shane Shorter.If the room has reached maximum capacity, you may view the session virtually inThe JW Marriott, Level 2, H.B. Plant Ballroom , \"SOF Team Room.\"Viewing schedule: 0830 - 1030"
    },
    {
      "name": "Ms. Sarah P. Roder, CFEI",
      "title": "Director of Partnerships and Member Engagement",
      "company": "AAFMAA",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/9860378660bc42d7a23d04e40b330f7e.png?f=webp",
      "detailed_bio": "Ms. Sarah P. Roder, CFEIDirector of Partnerships and Member Engagement AAFMAA Sarah Roder is the Director of Partnerships and Member Engagement at AAFMAA. She previously served as a Relationship Manager for AAFMAA Wealth Management and Trust, Senior Veterans Affairs Coordinator, the SpouseLink Ambassador for the Camp Lejeune area, and a member of the Member Benefits Team. Sarah holds the Certified Financial Education Instructor® designation, having completed the National Financial Educators Council Program. As a military spouse and mother, she enjoys spending time outdoors and helping others. She is a proud graduate of Auburn University.",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Financial Readiness for Military Retirement",
      "speaking_time": "10:35 AM-11:35 AM",
      "location": "Marriott Water Street: Florida Salon IV / Breakout Room 1",
      "session_description": "This session is a brief overview about debt, consumer advocacy and protection, money management, credit, financial planning, insurance, and consumer issues. Learn how to get your financial house in order before you begin the next chapter of life!"
    },
    {
      "name": "Sergeant Major Gregory Keller",
      "title": "POTFF Senior Enlisted Leader",
      "company": "U.S. Special Operations Command",
      "image_url": "",
      "detailed_bio": "",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Warrior Care Program (WCP) and Preservation of the Force and Family (POTFF) Update",
      "speaking_time": "10:35 AM-11:35 AM",
      "location": "Marriott Water Street: Florida Salon V - VI / Breakout Room 2",
      "session_description": "WCP and POTFF leaders will provide an overview of their programs, priorities and challenges."
    },
    {
      "name": "Mr. Arthur Coon",
      "title": "Director of Enterprise Information Systems",
      "company": "SOF AT&L, U.S. Special Operations Command",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/6ab1dff45ba94d0d99761411ceb446fe.png?f=webp",
      "detailed_bio": "",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Directorate Overview: Enterprise Information Systems (EIS)",
      "speaking_time": "10:45 AM-12:15 PM",
      "location": "Tampa Convention Center: Room 120 - 121",
      "session_description": "The Directorate Enterprise Information Systems (EIS) manages the development, acquisition, fielding, new equipment training, and sustainment of Garrison C4 and MISO [Military Information Support Information] systems. The portfolio includes two primary capability areas – Enterprise Networks & MISO Systems. Enterprise Information Systems will continue to integrate new or emerging technologies as part of its systems’ life cycle refresh, and in parallel, will leverage other government agencies and o..."
    },
    {
      "name": "Ms. Liliana Roman",
      "title": "Deputy Director, Enterprise Information Systems (EIS), SOF AT&L",
      "company": "U.S. Special Operations Command",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/a3e494abddae41b79a41a3a5ddf06595.jpg?f=webp",
      "detailed_bio": "Ms. Liliana RomanDeputy Director, Enterprise Information Systems (EIS), SOF AT&L U.S. Special Operations Command Ms. Liliana Roman, currently serving as the Deputy Director for Enterprise Information Systems (EIS) at the U.S. Special Operations Command (USSOCOM), brings a rich blend of expertise and leadership to her role. Appointed in May 2023, she oversees the development of fieldable prototypes and manages the acquisition and sustainment of SOF Garrison C4 Systems and Military Information Support Systems at MacDill Air Force Base in Florida. Her current position involves the oversight of seven key acquisition programs, with a substantial annual budget exceeding $618 million. Ms. Roman's career in federal service spans over 24 years, dedicating a significant portion of it to the Department of Defense. Her journey at USSOCOM is marked by 21 years of diverse experiences, where she notably contributed as Program Manager for Enterprise Networks and Acquisition Program Manager (APM) across various departments. Her roles included managing the Civil Information Management Data Processing System/Media Production Center (MPC) Enterprise, overseeing the Next Generation Infrastructure (NGI), and leading the C4IAS program. Before her tenure at USSOCOM, Ms. Roman served in the United States Army as a 25B, where she honed her skills and knowledge in information systems. Complementing her extensive professional experience, she holds a Bachelor of Science degree in Management Information S...",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Directorate Overview: Enterprise Information Systems (EIS)",
      "speaking_time": "10:45 AM-12:15 PM",
      "location": "Tampa Convention Center: Room 120 - 121",
      "session_description": "The Directorate Enterprise Information Systems (EIS) manages the development, acquisition, fielding, new equipment training, and sustainment of Garrison C4 and MISO [Military Information Support Information] systems. The portfolio includes two primary capability areas – Enterprise Networks & MISO Systems. Enterprise Information Systems will continue to integrate new or emerging technologies as part of its systems’ life cycle refresh, and in parallel, will leverage other government agencies and o..."
    },
    {
      "name": "Mr. Peter Bergen",
      "title": "Vice President Global Studies & Fellows, New America; Professor, Arizona State University;",
      "company": "CNN National Security Analyst; Chairman of the Board, Global SOF Foundation",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/9623e50a217a403ba5f2771ef1899788.jpg?f=webp",
      "detailed_bio": "Mr. Peter BergenVice President Global Studies & Fellows, New America; Professor, Arizona State University; CNN National Security Analyst; Chairman of the Board, Global SOF Foundation Peter Bergen is a journalist, documentary producer, vice president at New America, CNN national security analyst, professor of practice at Arizona State University, and the author or editor of ten books, three of which were New York Times bestsellers and four of which were named among the best non-fiction books of the year by the Washington Post. The books have been translated into twenty-four languages, and documentaries based on them have been nominated for two Emmys and won the Emmy for best documentary. Bergen also serves as New America’s Director of the International Security and Future of War programs. He writes a weekly column for CNN.com. He is a member of the Homeland Security Experts Group and a fellow at Fordham University’s Center on National Security. Bergen is on the editorial board of Studies in Conflict & Terrorism, a leading scholarly journal. He has held teaching positions at the Kennedy School of Government at Harvard University and the School of Advanced International Studies at Johns Hopkins University. For many years he was a fellow at New York University’s Center on Law and Security. He has testified before US Congressional committees eighteen times about national security issues. In 2011 he published The Longest War: The Enduring Conflict between America and Al-Qaeda. The ...",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Panel I: Deterrence through SOF Power: U.S. Combatant Commanders’ Perspectives",
      "speaking_time": "11:00 AM-12:00 PM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "The best war is the one you never have to fight. Combatant commanders will share how SOF’s unique capabilities deter conflict and prepare for victory when deterrence fails. Discussions will highlight SOF’s role in building partnerships, gaining access and intelligence, maintaining asymmetric advantages, and shaping conditions to prevail across the spectrum of conflict."
    },
    {
      "name": "Dr. Keenan Yoho",
      "title": "Vice President and Board Member",
      "company": "Global SOF Foundation",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/5d71e1d54f2e4b359fc8237a42c8828e.png?f=webp",
      "detailed_bio": "Dr. Keenan YohoVice President and Board Member Global SOF Foundation Dr. Keenan Yoho has spent more than a decade working with senior management leading change in both commercial and public sector environments. Dr. Yoho’s research and applied work is focused on supply chain cost modeling and operations management to achieve enterprise-wide outcomes under conditions of uncertainty and resource scarcity. Dr. Yoho served as Senior Special Advisor to U.S. Special Operations Command (USSOCOM) from 2012 to 2014. During this time Dr. Yoho worked with a special team reporting directly to the Commander, USSOCOM that was charged with crafting and executing a plan for posturing special operations forces (SOF) for the next three decades. Dr. Yoho has advised several U.S. and international organizations to include IBM (semiconductors), General Motors (autos), General Mills (foods), Intel (semiconductors), Rockwell Automation (machine automation), BASF (chemicals –Germany, US and Mexico), Merck, KGaA (chemicals – Germany), Ryerson (steel processing & distribution), Qualcomm (designer/supplier telecommunications technology), and Polioles SA de CV (chemicals – Mexico), the U.S. Army, U.S. Air Force, and U.S. Transportation Command in the areas of operations management, supply chain management, continuous improvement and organizational transformation. Prior to joining the Crummer Graduate School of Business at Rollins College, Dr. Yoho was an associate operations researcher at the RAND Corpor...",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Economic Coercion, Supply Chain Disruption, and Disinformation: Increasingly Common Instruments in Irregular Warfare",
      "speaking_time": "11:45 AM-12:45 PM",
      "location": "Marriott Water Street: Florida Salon IV / Breakout Room 1",
      "session_description": "The current and future security environment is characterized by a persistent and long-term struggle with a plurality of adversaries seeking to overturn the post-war order of international norms. Much of their efforts occur in the gray zone utilizing non-military means. This panel will discuss recent and powerful examples of irregular warfare tactics employed by our adversaries and how SOF can best compete and win."
    },
    {
      "name": "Ms. Emily Harding",
      "title": "Director of Intelligence, National Security Program; Vice President, Defense & Security Department",
      "company": "Center for Strategic and International Studies",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/2addff931fab454f89e879088674f02c.jpg?f=webp",
      "detailed_bio": "national security positions at critical moments. While serving as deputy staff director on the Senate Select Committee on Intelligence, she led the committee’s investigation into Russian interference in the 2016 elections, which was lauded for its bipartisanship. At CIA, she led analysts and analytic programs through moments of crisis, including shepherding the Iraq Group during the attempted Islamic State takeover. During a tour at the National Security Council, she served as director for Iran. After leaving the White House, her team ran the first Office of the Director of National Intelligence-led presidential transition, where she was responsible for briefing the incoming administration. Harding is an adjunct lecturer at the Johns Hopkins School of Advanced International Studies. Her analysis has appeared in the Wall Street Journal, BBC, NPR, Bloomberg, and other outlets. Harding holds a master’s degree from Harvard University’s Kennedy School of Government and a bachelor’s degree from the University of Virginia.",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Economic Coercion, Supply Chain Disruption, and Disinformation: Increasingly Common Instruments in Irregular Warfare",
      "speaking_time": "11:45 AM-12:45 PM",
      "location": "Marriott Water Street: Florida Salon IV / Breakout Room 1",
      "session_description": "The current and future security environment is characterized by a persistent and long-term struggle with a plurality of adversaries seeking to overturn the post-war order of international norms. Much of their efforts occur in the gray zone utilizing non-military means. This panel will discuss recent and powerful examples of irregular warfare tactics employed by our adversaries and how SOF can best compete and win."
    },
    {
      "name": "Colonel Jesse Marsalis",
      "title": "Program Executive Officer, PEO SOF Support Activity (SOFSA)",
      "company": "U.S. Special Operations Command",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/23f54e4624404adda269968c143a2585.png?f=webp",
      "detailed_bio": "Colonel Jesse MarsalisProgram Executive Officer, PEO SOF Support Activity (SOFSA) U.S. Special Operations Command Colonel Jesse R. Marsalis, a native of Natchitoches, LA, enlisted in the Army as a Combat Engineer in 1990. He was commissioned through the U.S. Army Officer Candidate School (OCS) in 1999 and entered the Army’s Acquisition Corps in 2009. COL Marsalis has over thirty-four years of experience in acquisition, combat, and operational assignments. His recent roles include serving as the Program Executive Officer for Special Operations Forces Support Activities at USSOCOM, Executive Officer for the U.S. Government’s COVID-19 vaccine operation (Operation Warp Speed), and Program Manager Special Programs at PEO Special Operations Warrior, USSOCOM. He also served as Legislative Liaison at the Office of the Chief, Legislative Liaison, and as a Defense Fellow to Senator Susan M. Collins (R-ME). His military leadership roles include Chief Program Integrator for the Combat Development Directorate at USASOC, Assistant Program Manager for Fire Support at USSOCOM, Commander of Alpha Company, 1st Special Troops Battalion, 101st Airborne Division, and Brigade Engineer for the 101st Airborne Division during Operation Iraqi Freedom. COL Marsalis has held numerous NCO and enlisted positions, including Squad Leader, Battalion Reconnaissance NCO, Team Leader, and Demolition Specialist in the 8th Engineer Battalion, 1st Cavalry Division, Fort Hood, TX. COL Marsalis holds a bachelor’s de...",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "PEO Overview: Special Operations Forces Support Activity (SOFSA)",
      "speaking_time": "12:15 PM-1:45 PM",
      "location": "Tampa Convention Center: Room 118 - 119",
      "session_description": "PEO - SOF Support Activity’s (SOFSA) mission is to manage the capability development, modification, and integration of SOF-peculiar equipment on a variety of SOF rotary- and fixed-wing aircraft as well as ground vehicles and maritime vessels. SOFSA provides responsive, tailored contractor logistic support worldwide to Special Operations Forces Component Commands and Theater SOCs to enhance Theater Combatant Commander (COCOM) readiness and warfighting capabilities. PEO SOFSA supervises execution ..."
    },
    {
      "name": "Mr. Joel J. Fox",
      "title": "Special Operations Forces Support Activity Program Manager - Expeditionary Support",
      "company": "U.S. Special Operations Command",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/ef05c324d12c462db20524e1af57920e.jpg?f=webp",
      "detailed_bio": "Mr. Joel J. FoxSpecial Operations Forces Support Activity Program Manager - Expeditionary Support U.S. Special Operations Command Mr. Joel J. Fox leads a diverse team of six government employees and contractor support personnel. PM-ES provides logistics-related capability development, enhancement, and support programs that deliver operational capabilities, programmatic expertise, and acquisition authority in support of Special Operations Forces. PM-ES is responsible to the PEO for managing the Joint Operational Stock Program; Foreign/Non-Standard Weapons, Materiel, and Munitions Program; Mobile Technology and Repair Complex Program; and providing contested logistics support to USSOCOM subordinate units and directorates. Prior to assuming his role as the PM for Expeditionary Support, Mr. Fox was the SOF Systems Branch Chief, managing contract support for four SOCOM components, eight PEOs/directorates, five Theater Special Operations Commands (TSOCs), the National Mission Forces, other high-priority units, and other government activities.",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "PEO Overview: Special Operations Forces Support Activity (SOFSA)",
      "speaking_time": "12:15 PM-1:45 PM",
      "location": "Tampa Convention Center: Room 118 - 119",
      "session_description": "PEO - SOF Support Activity’s (SOFSA) mission is to manage the capability development, modification, and integration of SOF-peculiar equipment on a variety of SOF rotary- and fixed-wing aircraft as well as ground vehicles and maritime vessels. SOFSA provides responsive, tailored contractor logistic support worldwide to Special Operations Forces Component Commands and Theater SOCs to enhance Theater Combatant Commander (COCOM) readiness and warfighting capabilities. PEO SOFSA supervises execution ..."
    },
    {
      "name": "Mr. Kareem Sykes",
      "title": "Industry & Engagement Program Manager",
      "company": "Project Spectrum",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/b231f243f73e401cbaa7a761f3a5fa04.jpg?f=webp",
      "detailed_bio": "Mr. Kareem SykesIndustry & Engagement Program Manager Project Spectrum Mr. Sykes currently provides Industry & Engagement support for Project Spectrum, a U.S. Department of Defense (DoD) recognized cybersecurity awareness initiative that offers resources, training, and tools toward increasing cybersecurity awareness and hygiene for small businesses in particular. Mr. Sykes provides strategic leadership for a dynamic team of cybersecurity and outreach professionals whose collective aim centers around providing the educational resources and tools small businesses and institutions need to develop, implement, and maintain cybersecurity compliance. He oversees and directs the daily execution of multiple projects within the large-scale program and assures that the initiative adheres to government regulatory guidance. Mr. Sykes also manages contractual requirements to assure that Project Spectrum meets the cost, schedule, and performance goals set by the DoD Office of Small Business Programs (OSBP). Prior to joining Project Spectrum, Mr. Sykes served as a dynamic and ITIL v4-certified Program Manager. He amassed more than 15 years of organizational thought leadership experience and leveraged proven Program and Project Management principles, rooted in the Project Management Body of Knowledge (PMBOK®) methodology. Mr. Sykes is particularly adept at implementing enhanced business processes that result in an economy of scale. He is a proven rapport and relationship cultivator who focuse...",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Project Spectrum: Training, Tools, and Applications for Cybersecurity Maturity Model Certification (CMMC)",
      "speaking_time": "12:30 PM-1:30 PM",
      "location": "Tampa Convention Center: Room 120 - 121",
      "session_description": "ProjectSpectrumis theDepartment of Defense’s (DoD) cybersecurity platform for small businesses in the Defense Industrial Base (DIB).ProjectSpectrumprovidesfree education, training, guidance, and tools to small businesses seeking to enhance their cybersecurity practices.ProjectSpectrumis dedicated to helping companies achieve their cybersecurity goals, including Cybersecurity Maturity Model Certification (CMMC) compliance, an essential certification for businesses looking to contract with DoD.Pro..."
    },
    {
      "name": "Ms. Juliet Funt",
      "title": "Founder and CEO",
      "company": "Juliet Funt Group",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/5f482d9d8fef4a78a29b99ea0d84fa64.png?f=webp",
      "detailed_bio": ", tough-love advisor to the Fortune 500, founder and CEO of the efficiency training firm, Juliet Funt Group. Juliet is the author of A Minute to Think, nominated for the Next Big Idea Club curated by Malcolm Gladwell, Dan Pink, Susan Cain and Adam Grant. She is an evangelist for freeing the potential of companies by unburdening their talent from busywork, and she has brought her powerful concepts to Spotify, National Geographic, Anthem, Vans, Abbott, Costco, Pepsi, Nike, Wells Fargo, Sephora, Sysco, and ESPN.",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Winning Back Time for the Mission: Creating White Space to Do Your Best Work",
      "speaking_time": "1:00 PM-2:00 PM",
      "location": "Marriott Water Street: Florida Salon IV / Breakout Room 1",
      "session_description": "With Juliet’s memorable stories, easy-to-use tools, and razor-sharp instruction, she carves an escape route from the overwhelm of low-value tasks and the daily avalanche of emails, meetings, decks, and reports. This session will help you find time for critical thinking and touch on important topics such as office work’s connection to great power competition, muddy communication and the price operators pay for it, burnout and balance, impact on family, and winning back time for the mission."
    },
    {
      "name": "Lieutenant General (Ret.) Giovanni Tuck",
      "title": "Former Director of Logistics (J4)",
      "company": "The Joint Staff",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/89fd94bf12bb49a6be4c9613fd61704d.jpg?f=webp",
      "detailed_bio": "Lieutenant General (Ret.) Giovanni TuckFormer Director of Logistics (J4) The Joint Staff Giovanni Tuck, a retired Air Force Lieutenant General, serves as the Chief Executive Officer at Robbins Gioia, LLC. Prior to joining Robbins Gioia, Lieutenant General Tuck served as the former Director of Logistics (J4), The Joint Staff, a former member of the Army Senior Executive Service as the Deputy Director, Supply, Production and Distribution, Federal COVID - 19 Response, and the Vice President for Global Military and Government Sales, CAE Healthcare, Inc. At CAE Healthcare, Inc. Lieutenant General Tuck led the organization's national and international military and government sales efforts to deliver worldwide safety and training environments from CAE’s vast array of innovative modeling, simulation and education product and services. As Acting Chief Operating Officer, he oversaw all manufacturing and logistics operations to include engineering, supply chain management, production and distribution, and information technology. Lieutenant General Tuck is a 33-year U.S. Air Force veteran and has a record of exceptional results in demanding, high-pressure environments. He is uniquely skilled in directing global operations, developing strategic plans, improving organizational cultures, and implementing vision, to lead the Joint Force to innovative outcomes. Lieutenant General Tuck possesses extensive experience in developing logistics, transportation, distribution, and supply chain strate...",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Panel II: Senior Insights on Global Threats | SOF Week General Session Closing Remarks",
      "speaking_time": "1:30 PM-2:35 PM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "This panel brings together senior national security leaders to examine how SOF employs all elements of national power—diplomatic, information, military, and economic (DIME)—to counter global threats. Panel insights will focus on SOF’s critical role in uniting these tools to outmaneuver modern threats."
    },
    {
      "name": "Captain Jared W. Wyrick",
      "title": "Program Executive Officer, PEO Maritime",
      "company": "U.S. Special Operations Command",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/72c2e3abc55c41e99ade7db6b8f4ad7f.png?f=webp",
      "detailed_bio": "",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "PEO Overview: Maritime (M)",
      "speaking_time": "2:00 PM-3:30 PM",
      "location": "Tampa Convention Center: Room 120 - 121",
      "session_description": "PEO-M’s mission is to provide game-changing capability to hyper-enable Naval Special Warfare operators through the development and fielding of advanced surface and undersea platforms and equipment to maintain and expand the competitive advantage in the maritime domain. The portfolio includes surface and undersea maritime mobility platforms in all stages of the acquisition lifecycle, to include development, production, and sustainment, as well as cutting edge SOF Combat Diving Equipment."
    },
    {
      "name": "Mr. Michael Quinn",
      "title": "Founder and Chief Growth Officer",
      "company": "Tenova LLC",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/5d93e2365d4846f8bab4730a1fde6e48.jpg?f=webp",
      "detailed_bio": "Mr. Michael QuinnFounder and Chief Growth Officer Tenova LLC As a prominent voice in the military-to-civilian transition space, Sergeant Major (Ret.) Michael Quinn led our Nation’s Soldiers for more than 24 years and has an incredible passion for giving",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "How to Market Yourself as a Job Seeker",
      "speaking_time": "2:00 PM-3:00 PM",
      "location": "Marriott Water Street: Florida Salon IV / Breakout Room 1",
      "session_description": "Starting your own business can be a scary endeavor for anyone, but it may be even more so for military veterans. Fortunately, there are resources available to help guide veteran entrepreneurs through all phases of the journey. This session will explore those resources and tap into expertise from those who have taken the leap themselves."
    },
    {
      "name": "Ms. Alison Messick",
      "title": "Chief Programs Officer",
      "company": "Navy SEAL Foundation",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/fb4ae8043e23456aaf820d19b3c65ffa.png?f=webp",
      "detailed_bio": "Ms. Alison MessickChief Programs Officer Navy SEAL Foundation As the Chief Programs Officer of the Navy SEAL Foundation (NSF), Alison leads comprehensive programming and critical support for the NSW force and their families, ensuring growth, stability, and effectiveness. She oversees a $24 million annual budget, evaluates programs for efficacy, and implements policies for improvement. Alison collaborates with experts and thought leaders to drive innovation, addressing key issues and identifying solutions. She also plans and executes NSF's Impact Forum and Thought Leaders' Symposium, fostering collaboration between federal and non-federal entities to enhance collective impact. Alison has over 20 years of experience in active duty and support services, specializing in military family readiness and organizational training. She served more than four years as a United States Marine in a frequently deployed unit with high-level security clearance. Previously, she was a Marine Corps Family Readiness Officer and Warrior and Family Support Coordinator at Naval Special Warfare (NSW) Group TWO, earning the Department of the Navy Meritorious Service Civilian Medal for her impact on NSW warriors and families. Her deep understanding of the NSW community’s challenges stems from decades of service with the U.S. Marine Corps, U.S. Navy, and Naval Special Warfare. Alison holds a Bachelor of Arts in history and journalism from the University of Maryland University College, a Master of Arts in g...",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Advancing the Warrior’s Edge: Leveraging Breakthroughs in Human Performance for Lasting Impact On and Off the Battlefield",
      "speaking_time": "2:15 PM-3:15 PM",
      "location": "Marriott Water Street: Florida Salon V - VI / Breakout Room 2",
      "session_description": "In the relentless pursuit of excellence, Special Operations Forces (SOF) operators constantly push the boundaries of human performance—mentally, emotionally, physically, and spiritually. Organizations and experts worldwide are at the forefront of this effort, investing in cutting-edge research and innovative practices that ensure operators not only achieve peak performance but sustain it throughout their careers and beyond. This panel brings together leading experts from the medical, scientific,..."
    },
    {
      "name": "Ms. Jennifer Zientz, MS, CCC-SLP",
      "title": "Director of Programs, Head of Clinical Services",
      "company": "Center for BrainHealth",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/250457014cda49a8bb95538959a5b495.png?f=webp",
      "detailed_bio": "Ms. Jennifer Zientz, MS, CCC-SLPDirector of Programs, Head of Clinical Services Center for BrainHealth Jennifer Zientz, Director of Programs and Head of Clinical Services at Center for BrainHealth®, focuses on the translation of BrainHealth research to improve how people think, work, and live. Jennifer administers performance-based assessments and facilitates training workshops that empower individuals across the lifespan to take the lead in strengthening their focus, mental efficiency, reasoning, and possibility thinking. She has facilitated SMART™ Brain Training for specialized groups, including military leadership, active-duty special operators, veterans and their spouses, law enforcement officers, corporate executives and leadership teams, community leaders, athletes, and graduate students. Her career in clinical research and translational application has contributed to the growing knowledge of the impact of cognitive training in health. Jennifer’s early work focused on the important role that complex language processing plays in the diagnosis and treatment of dementias. She also worked to define best practices for speech-language pathologists in the path of care for individuals with Alzheimer’s disease.",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Advancing the Warrior’s Edge: Leveraging Breakthroughs in Human Performance for Lasting Impact On and Off the Battlefield",
      "speaking_time": "2:15 PM-3:15 PM",
      "location": "Marriott Water Street: Florida Salon V - VI / Breakout Room 2",
      "session_description": "In the relentless pursuit of excellence, Special Operations Forces (SOF) operators constantly push the boundaries of human performance—mentally, emotionally, physically, and spiritually. Organizations and experts worldwide are at the forefront of this effort, investing in cutting-edge research and innovative practices that ensure operators not only achieve peak performance but sustain it throughout their careers and beyond. This panel brings together leading experts from the medical, scientific,..."
    },
    {
      "name": "Mr. Jeffery \"JD\" Barnes",
      "title": "Chief, International Operations, SOF AT&L",
      "company": "U.S. Special Operations Command",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/1244dfec52794983b52c73bd6c27610e.png?f=webp",
      "detailed_bio": "",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "Pathways for Doing International Business",
      "speaking_time": "3:00 PM-4:00 PM",
      "location": "Tampa Convention Center: Room 118 - 119",
      "session_description": "The International session will feature a presentation and discussion on potential pathways Industry partners could use to facilitate greater exposure on the International level and will focus on current International Cooperative R&D efforts, Foreign Comparative Testing, International Experimentation, and other International Programs. USSOCOM SOF AT&L International Operations Office collaborates with partner nations and industry partners to develop and field Special Operations-peculiar capabiliti..."
    },
    {
      "name": "Ms. Heidi Grant",
      "title": "Former Director of Defense Security Cooperation Agency",
      "company": "U.S. Department of Defense",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/8116b621afd54fa6a887e4f950fcfa7f.jpg?f=webp",
      "detailed_bio": "Ms. Heidi GrantFormer Director of Defense Security Cooperation Agency U.S. Department of Defense Heidi Grant is president of business development, where she leads a team representing Boeing’s defense, space and government services portfolios around the world. Grant joined Boeing in November 2021 from the U.S. Department of Defense, having served as director, Defense Security Cooperation Agency, responsible for all DoD security cooperation programs involving defense articles, military training and other defense-related services. There, she oversaw more than 15,000 military sales cases with more than 150 countries valued at more than $600 billion. She also managed a certification program for 20,000 civillian and military personnel. Before joining DSCA, Grant was director, Defense Technology Security Administration, responsible for developing and implementing global technology security policies for international transfer of defense-related goods, services, and technologies. In 2002, Grant was appointed to the Senior Executive Service and assigned as the first civilian director, resources and analysis, for U.S. operations in the Middle East, Central and South Asia and North East Africa. Working with senior representatives from 65 countries, she led resource strategy and analysis for operations Iraqi Freedom and Enduring Freedom. She later helped establish U.S. Africa Command as its first director of resources, leading personnel and financial programming that served as the foundat...",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "How Partner Nations Can Best Navigate USG Security Cooperation Processes",
      "speaking_time": "3:00 PM-4:00 PM",
      "location": "Marriott Water Street: Florida Salon IV / Breakout Room 1",
      "session_description": "This session will provide an overview of the U.S. Foreign Military Sales process and how it can benefit Partner Nation SOF and acquisition professionals."
    },
    {
      "name": "Dr. John Edgar Caterson",
      "title": "U.S. Special Operations Command SOCH ESME, SOCH Program Director",
      "company": "Joint Special Operations University",
      "image_url": "https://custom.cvent.com/60DA03D2917647F1BEA677B74A3098B8/files/event/461ba9425adb45cfa9e5e8e40dd9305c/7856bf970b804b028cfa2e2c03bb8518.jpg?f=webp",
      "detailed_bio": "Dr. John Edgar CatersonU.S. Special Operations Command SOCH ESME, SOCH Program Director Joint Special Operations University Dr. John Edgar Catterson serves as the SOCOM SOCH Joint Special Operations University Executive Subject Matter Expert (ESME) and as the Program Director for the Special Operations Chaplains Advanced Courses Program (SOCAC), as well as the Master SOF Instructor of Record for the SOF Ethical Leadership Advisement, the Spiritual & Moral Resiliency, Special Operations Crisis Care and Counseling, and Religious Support Team Orientation. A graduate of Princeton Theological Seminary, The University of Edinburgh in Scotland, and The Beeson International Center at Asbury Theological Seminary, he holds a Bachelor of Arts in Philosophy & Religion, a Master of Divinity with a concentration in ethics, was a Supervised Post-Graduate Fellow in Ethics & Leadership, and earned a Doctorate degree with concentrations in Story Integration, Narrative Theology, Leadership & Ethics, and Psychology.",
      "extraction_method": "speaker_card_with_fixed_bio",
      "session_title": "The Invisible Enemy: SOF Moral Injury and Intervention",
      "speaking_time": "3:30 PM-5:00 PM",
      "location": "Marriott Water Street: Florida Salon V - VI / Breakout Room 2",
      "session_description": ""
    },
    {
      "name": "ms. This event",
      "title": "",
      "company": "",
      "session_title": "SOF Week Welcome Remarks | Introduction to Special Operations Forces Acquisition, Technology, and Logistics (SOF AT&L)",
      "speaking_time": "9:55 AM-11:00 AM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "Join us for the formal kick-off for SOF Week 2025 followed by Mr. William \"Bill\" Innes presenting an overview of the command and acquisition center and its current programs. This event is structured to provide insight into initiatives and processes for those who have not recently done business with ...",
      "extraction_method": "session_content",
      "image_url": "",
      "detailed_bio": ""
    },
    {
      "name": "General Session Opening",
      "title": "",
      "company": "",
      "session_title": "General Session Opening Remarks | Welcome Remarks and Proclamation from the Mayor of Tampa | Welcome Remarks from Global SOF",
      "speaking_time": "8:25 AM-8:45 AM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "The SOF Week 2025 general session launches with a superb lineup of senior SOF leaders and national security practitioners.If the room has reached maximum capacity, you may view the session virtually inThe JW Marriott, Level 2, H.B. Plant Ballroom , \"SOF Team Room.\"Viewing schedule: 0830 - 1030",
      "extraction_method": "session_content",
      "image_url": "",
      "detailed_bio": ""
    },
    {
      "name": "Mayor of Tampa",
      "title": "",
      "company": "",
      "session_title": "General Session Opening Remarks | Welcome Remarks and Proclamation from the Mayor of Tampa | Welcome Remarks from Global SOF",
      "speaking_time": "8:25 AM-8:45 AM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "The SOF Week 2025 general session launches with a superb lineup of senior SOF leaders and national security practitioners.If the room has reached maximum capacity, you may view the session virtually inThe JW Marriott, Level 2, H.B. Plant Ballroom , \"SOF Team Room.\"Viewing schedule: 0830 - 1030",
      "extraction_method": "session_content",
      "image_url": "",
      "detailed_bio": ""
    },
    {
      "name": "general session launches",
      "title": "",
      "company": "",
      "session_title": "General Session Opening Remarks | Welcome Remarks and Proclamation from the Mayor of Tampa | Welcome Remarks from Global SOF",
      "speaking_time": "8:25 AM-8:45 AM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "The SOF Week 2025 general session launches with a superb lineup of senior SOF leaders and national security practitioners.If the room has reached maximum capacity, you may view the session virtually inThe JW Marriott, Level 2, H.B. Plant Ballroom , \"SOF Team Room.\"Viewing schedule: 0830 - 1030",
      "extraction_method": "session_content",
      "image_url": "",
      "detailed_bio": ""
    },
    {
      "name": "General Bryan Fenton",
      "title": "",
      "company": "",
      "session_title": "Keynote Address: U.S. Special Operations Command Team",
      "speaking_time": "9:15 AM-10:00 AM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "Keynote remarks from USSOCOM Commander, General Bryan Fenton and Senior Enlisted Leader, Command Sergeant Major Shane Shorter.If the room has reached maximum capacity, you may view the session virtually inThe JW Marriott, Level 2, H.B. Plant Ballroom , \"SOF Team Room.\"Viewing schedule: 0830 - 1030",
      "extraction_method": "session_content",
      "image_url": "",
      "detailed_bio": ""
    },
    {
      "name": "ms. The portfolio",
      "title": "",
      "company": "",
      "session_title": "Directorate Overview: Enterprise Information Systems (EIS)",
      "speaking_time": "10:45 AM-12:15 PM",
      "location": "Tampa Convention Center: Room 120 - 121",
      "session_description": "The Directorate Enterprise Information Systems (EIS) manages the development, acquisition, fielding, new equipment training, and sustainment of Garrison C4 and MISO [Military Information Support Information] systems. The portfolio includes two primary capability areas – Enterprise Networks & MISO Sy...",
      "extraction_method": "session_content",
      "image_url": "",
      "detailed_bio": ""
    },
    {
      "name": "ms. Enterprise Information",
      "title": "",
      "company": "",
      "session_title": "Directorate Overview: Enterprise Information Systems (EIS)",
      "speaking_time": "10:45 AM-12:15 PM",
      "location": "Tampa Convention Center: Room 120 - 121",
      "session_description": "The Directorate Enterprise Information Systems (EIS) manages the development, acquisition, fielding, new equipment training, and sustainment of Garrison C4 and MISO [Military Information Support Information] systems. The portfolio includes two primary capability areas – Enterprise Networks & MISO Sy...",
      "extraction_method": "session_content",
      "image_url": "",
      "detailed_bio": ""
    },
    {
      "name": "ms. Much of",
      "title": "",
      "company": "",
      "session_title": "Economic Coercion, Supply Chain Disruption, and Disinformation: Increasingly Common Instruments in Irregular Warfare",
      "speaking_time": "11:45 AM-12:45 PM",
      "location": "Marriott Water Street: Florida Salon IV / Breakout Room 1",
      "session_description": "The current and future security environment is characterized by a persistent and long-term struggle with a plurality of adversaries seeking to overturn the post-war order of international norms. Much of their efforts occur in the gray zone utilizing non-military means. This panel will discuss recent...",
      "extraction_method": "session_content",
      "image_url": "",
      "detailed_bio": ""
    },
    {
      "name": "General Session Closing",
      "title": "",
      "company": "",
      "session_title": "Panel II: Senior Insights on Global Threats | SOF Week General Session Closing Remarks",
      "speaking_time": "1:30 PM-2:35 PM",
      "location": "JW Marriott: Tampa Bay Ballroom",
      "session_description": "This panel brings together senior national security leaders to examine how SOF employs all elements of national power—diplomatic, information, military, and economic (DIME)—to counter global threats. Panel insights will focus on SOF’s critical role in uniting these tools to outmaneuver modern threat...",
      "extraction_method": "session_content",
      "image_url": "",
      "detailed_bio": ""
    },
    {
      "name": "ms. USSOCOM SOF",
      "title": "",
      "company": "",
      "session_title": "Pathways for Doing International Business",
      "speaking_time": "3:00 PM-4:00 PM",
      "location": "Tampa Convention Center: Room 118 - 119",
      "session_description": "The International session will feature a presentation and discussion on potential pathways Industry partners could use to facilitate greater exposure on the International level and will focus on current International Cooperative R&D efforts, Foreign Comparative Testing, International Experimentation...",
      "extraction_method": "session_content",
      "image_url": "",
      "detailed_bio": ""
    }
  ]
}